# PanelId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalOpening..::..PanelId Property
AnalyticalOpening Class See Also
---
ElementId of the AnalyticalPanel parent.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ElementId PanelId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PanelId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ PanelId {
	ElementId^ get ();
}
```

# See Also
AnalyticalOpening Class
Autodesk.Revit.DB.Structure Namespace